"""Системные константы"""

GITHUB_LINK = r"https://github.com/zextel/WelcomeBot"

"""Пункты меню и навигация"""
CMD_START_MENU_PHOTO = "Посмотреть на фото"
CMD_START_MENU_STORY = "Почитать кулстори"
CMD_START_MENU_VOICE = "Послушать войсов"
CMD_START_MENU_VCHAT = "Пообщаться войсами"

CMD_BACK = "Назад..."

CMD_GITHUB_TEXT = "Ссылка на публичный репозиторий:\n\n"

CMD_PHOTO_SELFIE_TEXT = "Селфи :)"
CMD_PHOTO_SCHOOL_TEXT  = "Фото со школы"
CMD_PHOTO_SELFIE_DESC = "Да, жизнь потрепала старичка..."
CMD_PHOTO_SCHOOL_DESC = "В туфлях, с пакетом - как на выборы :)"

CMD_STORY_FULL = """Своё главное увлечение я не могу выделить, но могу выделить, скорее, направление - созидательные увлечения.
Кулинария, строительство, программирование - всё, что нацелено на создание чего-то нового и совершенствование навыков.
Играю на укулеле, но больше развлечения ради - руки не заточены под аккуратную игру на струнных инструментах, хотя и получается"""

CMD_VOICE_DESCRIPTION = "Меню голосовых сообщений - какую хотите выбрать?"
CMD_VOICE_GRAND_GPT = '"Бабушкам о GPT"'
CMD_VOICE_SQL_NOSQL = "SQL vs NoSQL"
CMD_VOICE_HEARTBREAK = '"Как я встретил вашу маму"'

"""Ответные сообщения"""
REPLY_START = "Привет! Я - бот, реализованный в рамках соискательства трудоустройства в Яндекс.Практикум! Что Ты хочешь узнать? "
REPLY_VOICE = "На самом деле тут не нужен специальный пункт меню - можно смело записывать войсы, а ИИ постарается ответить :)"
REPLY_ERROR_RETRY = "Хм, что-то не так... Попробуй ещё раз или начни с команды /start:)"
REPLY_EXIT = "Пока! Был рад с тобой пообщаться!"

"""Шуточные сообщения на входящие войсы"""
REPLY_VOICE_JOKES = ['Все говорят "@s", а ты купи слона!\n\nШучу, сейчас отвечу :)',
                     'Я слышал как небеса шептали "@s", когда говорили о тебе...\n\nШучу, сейчас отвечу :)',
                     '"@s" - звучит как рекламный слоган!\n\nШучу, сейчас отвечу :)']
